InformationRegisters/СтавкиНДСПриУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтавкиНДСПриУСН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС12</Name>
					<Comment>Ставка НДС 12%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС16</Name>
					<Comment>Ставка НДС 16%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СтавкиНДСПриУСН/Ext/ManagerModule.bsl
Функция ПолучитьСтавкуНДСДляУСН(Организация, Период) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДСПриУСНСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.СтавкиНДСПриУСН.СрезПоследних(&Период, Организация = &Организация) КАК СтавкиНДСПриУСНСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтавкаНДС;
	КонецЦикла;
	
	Возврат Перечисления.СтавкиНДС.БезНДС;
	
КонецФункции

Процедура СкорректироватьСтавкуТовараДляУСН(СтавкаТовара, ОсновнаяСтавка) Экспорт
	
	// УСН применяет свою ставку кроме Номенклатуры с 0%.
	Если (		ОсновнаяСтавка = Перечисления.СтавкиНДС.БезНДС
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС5
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС7
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС5_105
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС7_107
		  )
		И СтавкаТовара <> Перечисления.СтавкиНДС.НДС0
	Тогда
		СтавкаТовара = ОсновнаяСтавка;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОМГ  

Функция омг_ПолучитьСтавкуНДСДляУСН(Организация, Период) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозЗначение = Перечисления.СтавкиНДС.БезНДС;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДСПриУСНСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.СтавкиНДСПриУСН.СрезПоследних(&Период) КАК СтавкиНДСПриУСНСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда   
		
		ВозЗначение = Выборка.СтавкаНДС;  
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДСПриУСНСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.СтавкиНДСПриУСН.СрезПоследних(&Период, Организация = &Организация) КАК СтавкиНДСПриУСНСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВозЗначение = Выборка.СтавкаНДС;
	КонецЕсли;
	
	Возврат ВозЗначение;
	
КонецФункции    

    // ОМГ    
	///////////////////////////////////////////////////////////////////////////////
